{"name":"Jesus Fornieles","headerTaglineOne":"Hello ","headerTaglineTwo":"I'm Jesus Fornieles - curious","headerTaglineThree":"designer and developer","headerTaglineFour":"based in Dublin, Ireland.","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/SrForni"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/jesus-fornieles-mu%C3%B1oz-9b0811305/"},{"id":"3","title":"Email","link":"mailto:jesusfornieles@gmail.com?subject=Contact%20from%20Your%20Portfolio&body=Hello%2C%0A%0AI%20would%20like%20to%20get%20in%20touch%20regarding%20your%20work.%0A%0ABest%20regards%2C%0A"}],"projects":[{"id":"1","title":"TestMaker","description":"A modern, interactive quiz application built with Next.js that generates customizable exams from CSV files.","imageSrc":"https://i.imgur.com/Lpwd0pB.png","url":"https://github.com/SrForni/TestMaker"},{"id":"2","title":"Pokedex iOS App","description":"An immersive application crafted with Swift that allows you to explore detailed Pok茅mon information and engage in thrilling battles.","imageSrc":"https://i.imgur.com/zPNxtqH.png","url":"https://github.com/alexcraviotto/pokedex"},{"id":"3","title":"AnimePowerScale","description":"A dynamic anime character power scaling game where players test their knowledge of character strength rankings from popular anime series.","imageSrc":"https://raw.githubusercontent.com/SrForni/AnimePowerScale/refs/heads/main/frontend/assets/2.png","url":"https://github.com/SrForni/AnimePowerScale"}],"services":[{"id":"1","title":"Web Design","description":"Creaci贸n y optimizaci贸n de interfaces web, dise帽o responsive y experiencia de usuario."},{"id":"2","title":"Deploy Apps","description":"Implementaci贸n de aplicaciones web y m贸viles en entornos de producci贸n de manera segura y escalable."},{"id":"3","title":"Cloud & DevOps","description":"Gesti贸n de infraestructura en la nube, automatizaci贸n de procesos y CI/CD para proyectos robustos."},{"id":"4","title":"Mobile Development","description":"Desarrollo de aplicaciones m贸viles nativas e h铆bridas para iOS y Android."}],"aboutpara":"I am a Software Engineer with experience in web and mobile development, specializing in React, Django, and PostgreSQL. I have worked on several personal and collaborative projects on GitHub, contributing improvements and optimizations that demonstrate my ability to learn quickly and apply best development practices.\n\nI am passionate about Cloud Computing and DevOps, and I continuously seek opportunities to integrate these skills into real world projects, learning new tools and methodologies to deliver efficient and scalable solutions.\n\nMy goal is to grow professionally in the IT field, contributing my software development experience and enthusiasm for cloud infrastructure, while participating in projects that challenge and expand my technical skills.\n\nI am open to new professional opportunities, particularly roles involving software development, cloud, and DevOps. I look forward to connecting with professionals and teams with similar interests to collaborate and learn together.","resume":{"tagline":"Software Engineer | Cloud & DevOps Enthusiast | Transforming Ideas Into Production-Ready Apps","description":"Well-versed with React, Javascript, and most of the Web frameworks. Passionate about Cloud Computing and DevOps","experiences":[{"id":"1","dates":"2025 (currently)","type":"Full Time","position":"Cable Technician at Actavo","bullets":"Repaired residential and commercial network systems, Ensuring optimal performance and connectivity. Diagnosed and resolved technical issues efficiently, Providing on-site support and excellent customer service. Collaborated with engineering and support teams to improve installation procedures and reduce service downtime."},{"id":"2","dates":"2025","type":"Full Time","position":"Software Developer at Filex Center","bullets":"Development of multiple websites related to law and real estate sales. Participate in and lead a high-performing development team, Fostering a collaborative and results-driven work environment. Collaborate with cross-functional teams to ensure timely delivery of scalable and user-centric web solutions."}],"education":{"universityName":"University of Almer铆a","universityDate":"2021 - 2025","universityPara":"SOFTWARE ENGINEERING (LEVEL 5-8)"},"languages":["Javascript","Python","Java","Typescript","C#"],"frameworks":["React","Typescript","NodeJs"],"others":["AWS","Azure"]}}